app/Controllers/Dashboard.php

SELECT *
FROM `sotc_goldcount`
WHERE `user_id` = '11'
---
    public function index()
    {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/login');
        }

        $userId = session()->get('user_id');
        $goldModel = new GoldModel();
        $data['goldcounts'] = $goldModel->where('user_id', $userId)->findAll();

UPDATE `sotc_goldcount` SET `gold_count` = '950804894849654', `updated_at` = '2024-06-23 15:05:28'
WHERE `sotc_goldcount`.`id` IN ('3')
---
    public function updateGoldCount($id)
    {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/login');
        }

        $userId = session()->get('user_id');
        $goldModel = new GoldModel();
        $goldcount = $goldModel->find($id);

        if ($goldcount['user_id'] == $userId) {
            $previousGoldCount = $goldcount['gold_count'];
            $newGoldCount = $this->request->getPost('gold_count');
            $difference = $newGoldCount - $previousGoldCount;

            $goldModel->update($id, ['gold_count' => $newGoldCount, 'updated_at' => date('Y-m-d H:i:s')]);