app/Controllers/Register.php

INSERT INTO `sotc_users` (`email`, `password`, `created_at`, `updated_at`) VALUES ('djscubamusic@gmail.com', '$2y$10$hSKOFYiwZmstHudV97/A4.rmwZQyFdg1o5Qfdu70NJmWxhvMBcxXu', '2024-06-15 17:09:19', '2024-06-15 17:09:19')
---
    public function register()
    {
        $rules = [
            'email' => ['rules' => 'required|min_length[4]|max_length[255]|valid_email|is_unique[sotc_users.email]'],
            'password' => ['rules' => 'required|min_length[8]|max_length[255]'],
            'confirm_password'  => [ 'label' => 'confirm password', 'rules' => 'matches[password]']
        ];


        if($this->validate($rules)){
            $model = new UserModel();
            $data = [
                'email'    => $this->request->getVar('email'),
                'password' => password_hash($this->request->getVar('password'), PASSWORD_DEFAULT)
            ];
            $model->save($data);